app/Controllers/Otel_AnaSayfa.php

SELECT *
FROM `oteller`
---
    public function index()
    {
        $otelModel = new OtelModel();
        $data['oteller'] = $otelModel->findAll();