app/Controllers/Restoran_AnaSayfa.php

    public function index()
    {
        $restoranModel = new RestoranModel();
        $data['restoranlar'] = $restoranModel->findAll();
---
SELECT *
FROM `restoranlar`