app/Controllers/SiteAnaSayfa.php

SELECT *
FROM `oteller`
SELECT *
FROM `restoranlar`
---
    public function index()
    {
        $otelModel = new OtelModel();
        $restoranModel = new RestoranModel();

        $data = [
            'oteller' => $otelModel->findAll(),
            'restoranlar' => $restoranModel->findAll(),
        ];